# 변수 & 초기화

dad = 132
ereq1123 ="3124"

# "dad" str : 값

# 123 int : 값

# 123.7 float : 값

# "hello" str : 값

# "\n" str : 값


#  자료형 

# 숫자 , 문자 

# 문자 
# 문자열 : string (줄)
# 문자열 = 문자 + 문자 + 문자 + ...
# 문자열 = 문자 + 문자
# 문자열 = 문자열 + 문자 + 문자
# 문자열 = 문자열 + 문자열
# ""
# " "
# "+"
# "21312"

# print("123"+"123")
# print("123123")


# 숫자
# 정수, 실수 

# 정수 int
# 3가지 : 양의정수, 0 , 음의정수
# 양의정수 (자연수) :1,2,, 99, 1000
# ...

# 실수 float 
# ________14.__________17
# 소스파일 -> 어셈블리 -> 오브젝트 -> 링커 -> (바이너리 파일) -> exe

a = 123
b = "C"
c = 5
print(f"{a}\n{b}")

# int str int str int 

# print(f"{a*c} * {c} * 3")

# 123 + 5 * 3

# print("%d * %d = %d" %(a,c,a*c))

a = 12
b = 12

temp = a +b +c
a = temp
b = temp
c = temp

a= b= c= temp

